# YOLOv5s 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 20  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5s v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, GhostConv, [128, 3, 2]],  # 1-P2/4
   [-1, 1, ECA, [128]],
   [-1, 3, C2fGhost, [128]],
   [-1, 1, GhostConv, [256, 3, 2]],  # 3-P3/8
   [-1, 1, ECA, [256]],
   [-1, 6, C2fGhost, [256]],
   [-1, 1, GhostConv, [512, 3, 2]],  # 5-P4/16
   [-1, 1, ECA, [512]],
   [-1, 9, C2fGhost, [512]],
   [-1, 1, GhostConv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, ECA, [1024]],
   [-1, 3, C2fGhost, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 14
  ]

# YOLOv5s v6.0 head
head:
  [[-1, 1, DWConv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [-1, 1, ECA, [512]],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C2fGhost, [512, False]],  #19

   [-1, 1, DWConv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [-1, 1, ECA, [256]],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C2fGhost, [256, False]],  #  (P3/8-small)

   [-1, 1, DWConv, [256, 3, 2]],
   [-1, 1, ECA, [256]],
   [[-1, 18], 1, Concat, [1]],  # cat head P4
   [-1, 3, C2fGhost, [512, False]],  # 22 (P4/16-medium)

   [-1, 1, DWConv, [512, 3, 2]],
   [-1, 1, ECA, [512]],
   [[-1, 14], 1, Concat, [1]],  # cat head P5
   [-1, 3, C2fGhost, [1024, False]],  # 25 (P5/32-large)

   [[23, 27, 31], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
